backend/app/controllers/csv_file_controller.rb

INSERT INTO "csv_files" ("csv_file_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["csv_file_name", "test.csv"], ["created_at", "2020-02-01 17:09:31.151758"], ["updated_at", "2020-02-01 17:09:31.151758"]]
INSERT INTO "pictures" ("url", "created_at", "updated_at", "csv_file_id") VALUES (?, ?, ?, ?)  [["url", "https://picsum.photos/id/12/300/200"], ["created_at", "2020-02-01 22:04:36.332784"], ["updated_at", "2020-02-01 22:04:36.332784"], ["csv_file_id", 1]]
---
	def create
    if csv_params.present?
      data = CsvParser.parse(csv_params[:file])

      if data[:pictures].present? && data[:file_name].present?
        form = CsvForm.new(data[:pictures], data[:file_name])

        if form.save